note/drawio/converted/dot/260420-display-select-logic-display.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_5OUoBaIc3aSdbqGUoIOj_1" [label="timepiece_datapath"];
  "n_5OUoBaIc3aSdbqGUoIOj_10" [label="o_sw0"];
  "n_5OUoBaIc3aSdbqGUoIOj_12" [label="input_conditioning"];
  "n_5OUoBaIc3aSdbqGUoIOj_14" [label="hour_fomat"];
  "n_5OUoBaIc3aSdbqGUoIOj_2" [label="timer_datapath"];
  "n_5OUoBaIc3aSdbqGUoIOj_5" [label="node_oIOj-5"];
  "n_5OUoBaIc3aSdbqGUoIOj_6" [label="display_select_logic"];
  "n_5OUoBaIc3aSdbqGUoIOj_7" [label="i_timer_value"];
  "n_5OUoBaIc3aSdbqGUoIOj_8" [label="i_timepiece_value"];
  "n_5OUoBaIc3aSdbqGUoIOj_9" [label="mux"];
  "n_Qh3KLExnjwxt7BLHPniv_2" [label="24"];
  "n_Qh3KLExnjwxt7BLHPniv_4" [label="o_display_value"];
  "n_Qh3KLExnjwxt7BLHPniv_5" [label="o_sw15"];
  "n_5OUoBaIc3aSdbqGUoIOj_12" -> "n_5OUoBaIc3aSdbqGUoIOj_14";
  "n_5OUoBaIc3aSdbqGUoIOj_2" -> "n_5OUoBaIc3aSdbqGUoIOj_9";
  "n_5OUoBaIc3aSdbqGUoIOj_1" -> "n_5OUoBaIc3aSdbqGUoIOj_9";
  "n_5OUoBaIc3aSdbqGUoIOj_12" -> "n_5OUoBaIc3aSdbqGUoIOj_9";
  "n_5OUoBaIc3aSdbqGUoIOj_9" -> "n_5OUoBaIc3aSdbqGUoIOj_14";
}
