note/drawio/converted/mermaid/260420-display-select-logic-display.mmd
flowchart LR
  n_5OUoBaIc3aSdbqGUoIOj_1["timepiece_datapath"]
  n_5OUoBaIc3aSdbqGUoIOj_10["o_sw0"]
  n_5OUoBaIc3aSdbqGUoIOj_12["input_conditioning"]
  n_5OUoBaIc3aSdbqGUoIOj_14["hour_fomat"]
  n_5OUoBaIc3aSdbqGUoIOj_2["timer_datapath"]
  n_5OUoBaIc3aSdbqGUoIOj_5["node_oIOj-5"]
  n_5OUoBaIc3aSdbqGUoIOj_6["display_select_logic"]
  n_5OUoBaIc3aSdbqGUoIOj_7["i_timer_value"]
  n_5OUoBaIc3aSdbqGUoIOj_8["i_timepiece_value"]
  n_5OUoBaIc3aSdbqGUoIOj_9["mux"]
  n_Qh3KLExnjwxt7BLHPniv_2["24"]
  n_Qh3KLExnjwxt7BLHPniv_4["o_display_value"]
  n_Qh3KLExnjwxt7BLHPniv_5["o_sw15"]
  n_5OUoBaIc3aSdbqGUoIOj_12 --> n_5OUoBaIc3aSdbqGUoIOj_14
  n_5OUoBaIc3aSdbqGUoIOj_2 --> n_5OUoBaIc3aSdbqGUoIOj_9
  n_5OUoBaIc3aSdbqGUoIOj_1 --> n_5OUoBaIc3aSdbqGUoIOj_9
  n_5OUoBaIc3aSdbqGUoIOj_12 --> n_5OUoBaIc3aSdbqGUoIOj_9
  n_5OUoBaIc3aSdbqGUoIOj_9 --> n_5OUoBaIc3aSdbqGUoIOj_14
